?- append([a,b,c,d],[w,x,y,z],Out).
Out = [a, b, c, d, w, x, y, z].


?- append(X,Y,[a,b,c]).
X = [],
Y = [a, b, c] ;
X = [a],
Y = [b, c] ;
X = [a, b],
Y = [c] ;
X = [a, b, c],
Y = [] ;


append

append([],X,X).
append([H|T],X,[H|Y]):-append(T,X,Y).

列表连接的定义（前一行说空列表与列表X连接得X，后一行说列表T与列表X连接之后成为列表Y）


?- append([1,2],[3,4,5],[1,2,3,4,5]).
true.

?- append([1,2],[3,4,5],[1,2,3,4,5,k]).
false.

?- append([1,2],[3,4,5],[1,2,3,4,5,6]).
false.

?- append([1,2],X,[1,2,31,41,51,93]).
X = [31, 41, 51, 93].

?- append(X,[3,4,5],[1,2,3,4,5]).
X = [1, 2] .

?- append(X,[3,6,5],[1,2,3,4,5]).
false.

?- append(X,Y,[31,42,78]).
X = [],
Y = [31, 42, 78] ;
X = [31],
Y = [42, 78] ;
X = [31, 42],
Y = [78] ;
X = [31, 42, 78],
Y = [] ;
false.














